<template>
    <div>
        <h2 class="secondary--text">Сборник рецептов по принципу “Чем проще - тем лучше”</h2>
        <section>
            <em>Keep it short and simple</em>
            <h3 class="secondary--text">Чего здесь не будет</h3>
            <ul class="list-style-type-wrong">
                <li>
                    сложных рецептов, в которых больше 10 ингредиентов, à la “равиоли со шпинатом и рикоттой в шалфейном
                    масле”
                </li>
                <li>вводной информации об истории рецепта</li>
                <li>выпечки, чтобы не мыть гору посуды</li>
                <li>пошаговых фото</li>
                <li>рекламы</li>
            </ul>
        </section>
        <br />
        <section>
            <h3 class="secondary--text">Основные функции</h3>
            <ul class="list-style-type-feature">
                <li>
                    Поиск
                    <ul class="list-style-type-diamond">
                        <li>По названию</li>
                        <li>По ингредиентам</li>
                    </ul>
                </li>
                <li>
                    Фильтрация
                    <ul class="list-style-type-diamond">
                        <li>По категориям</li>
                        <li>По особенностям</li>
                        <li>По сезону</li>
                        <li>По количеству порций</li>
                    </ul>
                </li>
                <li>
                    Показать ссылки на продукты в Сбермаркете. Можно выбрать магазин, задать сортировку и включить
                    переключатель "Со скидкой". Превращает ингредиенты в ссылки для удобного поиска в Сбермаркете.
                    Автоматизирует следующие действия: открыть сайт, выбрать магазин, ввести в строку поиска ингредиент,
                    нажать Enter, переключить сортировку. В мобильной версии недоступно
                </li>
                <li>Шпаргалки</li>
                <li>Настройки. Сохранение выбранного магазина, показ ссылок на продукты</li>
            </ul>
        </section>
    </div>
</template>

<style lang="scss" scoped>
.list-style-type-wrong {
    li {
        list-style-type: '❌';
    }
}
.list-style-type-feature {
    li {
        list-style-type: '⭐️';
    }
}
.list-style-type-diamond {
    li {
        list-style-type: '🔹';
    }
}
</style>
